app/Validation/Userrules.php

SELECT *
FROM `users`
WHERE `email` = 'aslanadmin@gmail.com'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data)
    {
        $model = new User();
        $user = $model->where('email', $data['email'])
            ->first();