app/Controllers/AdminController.php

    public function __construct()
    {

        $userModel = new User();
        $user = $userModel->where('name', session()->get('name'))->first();
---
SELECT *
FROM `users`
WHERE `name` = 'aslan admin'
 LIMIT 1

    public function index()
    {
        $userModel = new User();

        $data['users'] = $userModel->select('role')
                           ->where('name', session()->get('name'))
                           ->first();
---
SELECT `role`
FROM `users`
WHERE `name` = 'aslan admin'
 LIMIT 1