app/Controllers/ProductImagesController.php

SELECT *
FROM `product_images`
SELECT *
FROM `products`
---
    public function index()
    {
        $productImageModel = new ProductImages();
        $productModel = new Product();
        $data['title'] = 'Product Image';
        $data['productimages'] = $productImageModel->findAll();
        $data['product'] = $productModel->findAll();