app/Models/Category.php

SELECT *
FROM `categories`
---
    public function getCategory()
    {
        return $this->findAll();