app/Models/Product.php

    public function getProduct()
    {
        return $this->findAll();
---
SELECT *
FROM `products`